Revit 2027 API
SlabShapeVertexArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual SlabShapeVertex this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As SlabShapeVertex
	Get
	Set
public:
virtual property SlabShapeVertex^ Item[int index] {
	SlabShapeVertex^ get (int index);
	void set (int index, SlabShapeVertex^ value);
}
abstract Item : SlabShapeVertex with get, set
override Item : SlabShapeVertex with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
SlabShapeVertex
Returns the object at the specified index.
See Also
Reference
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace